---
type: StructuralSectionPipeStandard
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionPipeStandard

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionPipeStandard | 2015 | `public StructuralSectionPipeStandard ( double diameter , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double wallNominalThickness , double wallDesignThickness , double sectionArea , d` |